app/Http/Controllers/MuambasController.php

    public function create(Request $request)
    {
        $muamba = new Muamba();
        $muamba->nome = trim($request->nome);
        $muamba->codigo_rastreio = trim($request->codigo_rastreio);
        $muamba->user_id = $request->user_id;

        if ($muamba->save()) {
---
insert into `muambas` (`nome`, `codigo_rastreio`, `user_id`, `updated_at`, `created_at`) values ('Placa Wifi', 'OF365015696BR', '1', '2018-04-05 01:28:40', '2018-04-05 01:28:40')