app/Http/Controllers/MuambasController.php

    public function create(Request $request)
    {
        $muamba = new Muamba();
        $muamba->nome = trim($request->nome);
        $muamba->codigo_rastreio = trim($request->codigo_rastreio);
        $muamba->user_id = $request->user_id;

        if (Correios::rastrear($request->codigo_rastreio) != false) {
            if ($muamba->save()) {
---
insert into `muambas` (`nome`, `codigo_rastreio`, `user_id`, `updated_at`, `created_at`) values ('Placa Wifi', 'OF365015696BR', '1', '2018-04-09 19:10:53', '2018-04-09 19:10:53')

    public function form_edit($id)
    {
        $content_header = "Alterar Muamba";
        $muamba = Muamba::where('id', $id)->first();
---
select * from `muambas` where `id` = '7' limit 1

    public function update(Request $request)
    {
        $muamba = Muamba::where('id', $request->id)->first();
---
select * from `muambas` where `id` = '1' limit 1

    public function confirmar_recebimento(Request $request)
    {
        DB::beginTransaction();

        try {
            $muamba = Muamba::where('id', $request->id)->first();
            $muamba->fl_recebido = 1;

            if (!$muamba->save()) {
---
select * from `muambas` where `id` = '2' limit 1
update `muambas` set `fl_recebido` = '1', `updated_at` = '2018-04-09 19:11:15' where `id` = '2'

    public function delete(Request $request)
    {
        if (Muamba::destroy($request->id)) {
---
delete from `muambas` where `id` = '6'