app/Http/Controllers/UsuariosController.php

select * from `users` where `id` = '1' limit 1
---
    public function edit()
    {
        $content_header = "Alterar Senha";
        $usuario = User::where('id', Auth::id())->first();

select * from `users` where `id` = '1' limit 1
---
    public function update(Request $request)
    {
        $usuario = User::where('id', $request->id)->first();